Core/src/DataProcessors/БизнесСеть/БизнесСеть.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>БизнесСеть</name>
</mdclass:DataProcessor>

Core/src/InformationRegisters/Пользователи1СБизнесСеть/Пользователи1СБизнесСеть.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Пользователи1СБизнесСеть</name>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>DefinedType.Участники1СБизнесСеть</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПраваНаЗапретРедактированияДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyСкладскойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AzRyСкладыДляКонтроляОстатков</name>
    <attributes>
      <name>Актуальность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/DataProcessors/БизнесСеть/Forms/НастройкаПодключения/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Если Не Пользователи.РолиДоступны("АдминистрированиеАбонентаБизнесСеть") Тогда
		ТекстОшибки = НСтр("ka='Недостаточно прав доступа для выполнения операции в сервисе 1С:Бизнес-сеть';ru='Недостаточно прав доступа для выполнения операции в сервисе 1С:Бизнес-сеть';en='Not enough permissions to perform the operation when 1C: Business Network'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Если Не ИнформационнаяБазаПодключенаКСервису() Тогда
		ТекстОшибки = НСтр("ka='Информационная база не подключена к сервису 1С:Бизнес-сеть.';ru='Информационная база не подключена к сервису 1С:Бизнес-сеть.';en='The information base is not connected to the service of 1C: Business Network.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ОбновитьИнформациюДляТехническойПоддержки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СинхронизироватьПользователей(Команда)
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	
	ДопПараметры = Новый Структура;
	Результат = Неопределено;
	БизнесСетьВызовСервера.ОбновитьПользователейВСервисе(Неопределено, Ложь, Результат, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Текст = НСтр("ka='Пользователи информационной базы синхронизированы с сервисом 1С:Бизнес-сеть.';ru='Пользователи информационной базы синхронизированы с сервисом 1С:Бизнес-сеть.';en='Community information database synchronized with the service of 1C: Business Network.'");
	ПоказатьОповещениеПользователя(НСтр("ka='1С:Бизнес-сеть';ru='1С:Бизнес-сеть';en='1C: Business Network'"),, Текст, БиблиотекаКартинок.БизнесСеть);
	
	ОбновитьИнформациюДляТехническойПоддержки();
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьПодключение(Команда)
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	
	ДопПараметры = Новый Структура;
	Результат = Неопределено;
	БизнесСетьВызовСервера.ОбновитьПользователейВСервисе(Неопределено, Истина, Результат, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Текст = НСтр("ka='Информационная база синхронизирована с сервисом 1С:Бизнес-сеть.';ru='Информационная база синхронизирована с сервисом 1С:Бизнес-сеть.';en='The information base is synchronized with the service of 1C: Business Network.'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	
	ОбновитьИнформациюДляТехническойПоддержки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьИнформационнуюБазу(Команда)
	
	ТекстВопроса = НСтр("ru='Будет произведено отключение информационной базы от сервиса 1С:БизнесСеть."
"Для других участников сервиса, организации будут отображаться как подключенные."
"Полное удаление организаций в сервисе производится в форме настройки подключения.';ka='Будет произведено отключение информационной базы от сервиса 1С:БизнесСеть."
"Для других участников сервиса, организации будут отображаться как подключенные."
"Полное удаление организаций в сервисе производится в форме настройки подключения.'");
	ПоказатьВопрос(Новый ОписаниеОповещения("ОтключитьИнформационнуюБазуПродолжение", ЭтаФорма), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ИнформационнаяБазаПодключенаКСервису()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Пользователи1СБизнесСеть.СсылкаНаОбъект
	|ИЗ
	|	РегистрСведений.Пользователи1СБизнесСеть КАК Пользователи1СБизнесСеть";
	
	Результат = НЕ Запрос.Выполнить().Пустой();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьИнформациюДляТехническойПоддержки()
	
	// Получение идентификатора информационной базы.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи1СБизнесСеть.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.Пользователи1СБизнесСеть КАК Пользователи1СБизнесСеть
	|ГДЕ
	|	Пользователи1СБизнесСеть.СсылкаНаОбъект = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИдентификаторИнформационнойБазы = "";
	ИдентификаторПользователя = "";
	
	УстановитьПривилегированныйРежим(Истина);
	Ссылка = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("РегистрСведений.Пользователи1СБизнесСеть");
	ИдентификаторИнформационнойБазы = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Ссылка, "ПарольБизнесСеть");
	УстановитьПривилегированныйРежим(Ложь);	
	
	Если Выборка.Следующий() Тогда
		ИдентификаторПользователя = Выборка.Идентификатор;
	КонецЕсли;
	
	Шаблон = НСтр("ka='Подключение к сервису 1С:Бизнес-сеть:';ru='Подключение к сервису 1С:Бизнес-сеть:';en='Connection to the service of 1C: Business Network:'");
	Если НЕ ПустаяСтрока(ИдентификаторИнформационнойБазы) Тогда
		Шаблон = Шаблон + Символы.ПС + НСтр("ka='Ключ информационной базы: %1';ru='Ключ информационной базы: %1';en='Key information database% 1'");
	КонецЕсли; 
	Если НЕ ПустаяСтрока(ИдентификаторПользователя) Тогда
		Шаблон = Шаблон + Символы.ПС + НСтр("ka='Ключ пользователя: %2';ru='Ключ пользователя: %2';en='User Key: 2%'");
	КонецЕсли;
	
	Шаблон = Шаблон + Символы.ПС + НСтр("ka='Версия библиотеки электронных документов: %3';ru='Версия библиотеки электронных документов: %3';en='Library version of electronic documents: 3%'");
	
	ВерсияБиблиотеки = ОбновлениеИнформационнойБазыБЭД.ВерсияБиблиотеки();
	
	ТекстДляТехнологическойПоддержки = СтрШаблон(Шаблон, 
		ИдентификаторИнформационнойБазы, ИдентификаторПользователя, ВерсияБиблиотеки);
		
	ОбновитьИнформациюСостояниеСинхронизацииПользователей();
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюСостояниеСинхронизацииПользователей()
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получение списка пользователей информационной базы.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Пользователи.Ссылка КАК Ссылка,
	|	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи";
	
	СписокПользователей = Запрос.Выполнить().Выгрузить();
	
	// Анализ ролей пользователей.
	СтрокиУдаления = Новый Массив;
	Для каждого СтрокаТаблицы Из СписокПользователей Цикл
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(СтрокаТаблицы.ИдентификаторПользователяИБ);
		Если ПользовательИБ = Неопределено Тогда
			СтрокиУдаления.Добавить(СтрокаТаблицы);
			Продолжить;
		КонецЕсли;
		СписокРолей = "ПолныеПрава, АдминистраторСистемы, АдминистрированиеАбонентаБизнесСеть, ВыполнениеОбменаБизнесСеть";
		Если НЕ Пользователи.РолиДоступны(СписокРолей, СтрокаТаблицы.Ссылка) Тогда
			СтрокиУдаления.Добавить(СтрокаТаблицы);
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	// Удаление неподключенных пользователей.
	Для каждого СтрокаУдаления Из СтрокиУдаления Цикл
		СписокПользователей.Удалить(СтрокаУдаления);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокПользователей.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СписокПользователей
	|ИЗ
	|	&СписокПользователей КАК СписокПользователей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Пользователь КАК Пользователь
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Пользователь КАК Пользователь,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоПользователи) КАК ЭтоПользователи,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоИдентификаторы) КАК ЭтоИдентификаторы
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СписокПользователей.Ссылка КАК Пользователь,
	|			ИСТИНА КАК ЭтоПользователи,
	|			NULL КАК ЭтоИдентификаторы
	|		ИЗ
	|			СписокПользователей КАК СписокПользователей
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Пользователи1СБизнесСеть.СсылкаНаОбъект,
	|			NULL,
	|			ИСТИНА
	|		ИЗ
	|			РегистрСведений.Пользователи1СБизнесСеть КАК Пользователи1СБизнесСеть
	|		ГДЕ
	|			Пользователи1СБизнесСеть.СсылкаНаОбъект <> &НеуказанныйПользователь) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Пользователь) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.ЭтоПользователи <> ВложенныйЗапрос.ЭтоИдентификаторы";
	
	Запрос.УстановитьПараметр("СписокПользователей", СписокПользователей);
	
	НеуказанныйПользователь = Пользователи.СсылкаНеуказанногоПользователя();
	Запрос.УстановитьПараметр("НеуказанныйПользователь", НеуказанныйПользователь);
	
	Если Запрос.Выполнить().Пустой() Тогда
		
		СостояниеСинхронизацииПользователей = НСтр("ka='Синхронизация пользователей не требуется.';ru='Синхронизация пользователей не требуется.';en='user synchronization is not required.'");
		Элементы.СостояниеСинхронизацииПользователей.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		
	Иначе
		
		СостояниеСинхронизацииПользователей = НСтр("ka='Требуется синхронизация пользователей.';ru='Требуется синхронизация пользователей.';en='Need to synchronize users.'");
		Элементы.СостояниеСинхронизацииПользователей.ЦветТекста = ЦветаСтиля.ПоясняющийОшибкуТекст;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьИнформационнуюБазуПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ТребуетсяОбновитьИнтерфейс = Ложь;
	
	БизнесСетьВызовСервера.ОтключитьОрганизации(Неопределено, Ложь, Отказ, ТребуетсяОбновитьИнтерфейс);
	Если ТребуетсяОбновитьИнтерфейс Тогда
		#Если НЕ ВебКлиент Тогда
		ОбновитьИнтерфейс();
		#КонецЕсли
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
	СправочникОрганизации = ЭлектронноеВзаимодействиеСлужебныйКлиентПовтИсп.ИмяПрикладногоСправочника("Организации");
	ОповеститьОбИзменении(Тип("СправочникСсылка." + СправочникОрганизации));
	
	ПоказатьОповещениеПользователя(НСтр("ka='1С:Бизнес-сеть';ru='1С:Бизнес-сеть';en='1C: Business Network'"),, НСтр("ka='Информационная база отключена от сервиса 1С:Бизнес-сеть.';ru='Информационная база отключена от сервиса 1С:Бизнес-сеть.';en='The information base is disconnected from the service of 1C: Business Network.'"), БиблиотекаКартинок.БизнесСеть);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
